app/controllers/airports_controller.rb

SELECT "airports".* FROM "airports"
---
  def index
    airports = Airport.all

INSERT INTO "airports" ("name", "abbrv", "plane_capacity", "created_at", "updated_at", "international") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Badsfield Intl"], ["abbrv", "BAD"], ["plane_capacity", 49], ["created_at", "2022-12-16 17:00:59.022637"], ["updated_at", "2022-12-16 17:00:59.022637"], ["international", 1]]
---
  def create
    new_airport = Airport.create!(airport_params)

UPDATE "airports" SET "plane_capacity" = ?, "updated_at" = ?, "international" = ? WHERE "airports"."id" = ?  [["plane_capacity", 7], ["updated_at", "2022-12-16 19:12:26.534638"], ["international", 0], ["id", 2]]
---
  def update
    @airport.update!(airport_params)

DELETE FROM "airports" WHERE "airports"."id" = ?  [["id", 4]]
---
  def destroy
    # airport = Airport.find(params[:airport])
    @airport.destroy

SELECT "airports".* FROM "airports" WHERE "airports"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def find_airport
    @airport = Airport.find(params[:id])